'''易经起卦，用最近的3句的句长，也可以指定数字'''
from main import random

#     000  001  010  011  100  101  110  111
#     111  110  101  100  011  010  001  000
卦 = ['天','泽','火','雷','风','水','山','地']

六十四卦=[
    ['乾为天',  '天泽履',   '天火同人', '天雷无妄', '天风姤',   '天水讼',   '天山遯',   '天地否'],

    ['泽天夬',  '兑为泽',   '泽火革',   '泽雷随',   '泽风大过', '泽水困',   '泽山咸',   '泽地萃'],

    ['火天大有','火泽睽',   '离为火',   '火雷噬嗑', '火风鼎',   '火水未济', '火山旅',   '火地晋'],

    ['雷天大壮','雷泽归妹', '雷火丰',   '震为雷',   '雷风恒',   '雷水解',   '雷山小过', '雷地豫'],

    ['风天小畜','风泽中孚', '风火家人', '风雷益',   '巽为风',   '风水涣',   '风山渐',   '风地观'],

    ['水天需',  '水泽节',   '水火既济', '水雷屯',   '水风井',   '坎为水',   '水山蹇',   '水地比'],

    ['山天大蓄','山泽损',   '山火贲',   '山雷颐',   '山风蛊',   '山水蒙',   '艮为山',   '山地剥'],

    ['地天泰',  '地泽临',   '地火明夷', '地雷复',   '地风升',   '地水师',   '地山谦',   '坤为地'],
]

数 = ['初%s','%s二','%s三','%s四','%s五','上%s']
阴阳 = {'0':'九','1':'六'}
def get(i,j,k):
    i %= 8
    j %= 8
    k %= 6
    s = f'{j:03b}{i:03b}'
    return f'{六十四卦[i][j]}, {s}, {数[k]%阴阳[s[k]]}'


def run(body:str):
    if body.strip():
        params = body.strip().split(' ')
        i,j,k = map(int,params)
    else:
        # i = msglog(1)
        # j = msglog(2)
        # k = msglog(3)
        # i = len(msglog(1))-1 if i is not None else random.randint(0,7)
        # j = len(msglog(2))-1 if j is not None else random.randint(0,7)
        # k = len(msglog(3))-1 if k is not None else random.randint(0,5)
        i = random.randint(0,7)
        j = random.randint(0,7)
        k = random.randint(0,5)
    return get(i,j,k)
